In [57]:
import numpy as np

In [58]:
import pandas as pd

In [59]:
county_data = pd.read_csv("county_data_00_10.csv")

In [60]:
county_data.shape

(29900, 50)

In [61]:
county_data.head()

,SUMLEV,STATE,COUNTY,STNAME,CTYNAME,YEAR,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,...,HBA_MALE,HBA_FEMALE,HIA_MALE,HIA_FEMALE,HAA_MALE,HAA_FEMALE,HNA_MALE,HNA_FEMALE,HTOM_MALE,HTOM_FEMALE
0,50,29,1,Missouri,Adair County,1,0,248,134,114,...,0,0,0,0,0,0,0,0,0,0
1,50,29,1,Missouri,Adair County,1,1,1073,543,530,...,0,1,0,1,0,0,0,0,0,0
2,50,29,1,Missouri,Adair County,1,2,1275,685,590,...,0,0,1,1,0,0,0,0,1,0
3,50,29,1,Missouri,Adair County,1,3,1330,651,679,...,0,1,0,0,0,0,0,0,0,0
4,50,29,1,Missouri,Adair County,1,4,3162,1375,1787,...,2,0,1,0,0,0,0,0,0,4

In [62]:
stl_data = county_data[county_data['CTYNAME'] == "St. Louis city"]

In [63]:
stl_data.shape

(260, 50)

In [64]:
stl_data.head()

,SUMLEV,STATE,COUNTY,STNAME,CTYNAME,YEAR,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,...,HBA_MALE,HBA_FEMALE,HIA_MALE,HIA_FEMALE,HAA_MALE,HAA_FEMALE,HNA_MALE,HNA_FEMALE,HTOM_MALE,HTOM_FEMALE
29640,50,29,510,Missouri,St. Louis city,1,0,4663,2423,2240,...,10,9,0,1,0,0,0,0,9,3
29641,50,29,510,Missouri,St. Louis city,1,1,18811,9491,9320,...,50,46,4,3,3,4,0,1,13,10
29642,50,29,510,Missouri,St. Louis city,1,2,26711,13543,13168,...,48,77,4,5,3,3,1,0,11,9
29643,50,29,510,Missouri,St. Louis city,1,3,25023,12592,12431,...,51,52,5,6,6,3,0,0,15,10
29644,50,29,510,Missouri,St. Louis city,1,4,24731,12284,12447,...,45,51,3,3,3,2,0,0,7,14

In [65]:
stl_data_filtered = stl_data[["YEAR", "AGEGRP", "TOT_POP"]]

In [66]:
stl_data_filtered.shape

(260, 3)

In [67]:
stl_data_filtered = stl_data_filtered[stl_data_filtered["YEAR"] != 2]

In [68]:
stl_data_filtered = stl_data_filtered[stl_data_filtered["YEAR"] != 13]

In [69]:
stl_data_filtered.shape

(220, 3)

In [70]:
def fix_year(year):
    if year == 1:
        return 2000
    else:
        return 1998 + year

stl_data_filtered["YEAR"] = stl_data_filtered["YEAR"].apply(func=fix_year)

In [71]:
stl_data_filtered.head()

       YEAR  AGEGRP  TOT_POP
29640  2000       0     4663
29641  2000       1    18811
29642  2000       2    26711
29643  2000       3    25023
29644  2000       4    24731

In [72]:
stl_student_aged = stl_data_filtered.loc[(stl_data_filtered["AGEGRP"] >= 2) & (stl_data_filtered["AGEGRP"] <= 4)]

In [73]:
stl_student_aged.shape

(33, 3)

In [74]:
stl_student_aged.head()

       YEAR  AGEGRP  TOT_POP
29642  2000       2    26711
29643  2000       3    25023
29644  2000       4    24731
29682  2001       2    24951
29683  2001       3    24849

In [75]:
stl_students_by_year = pd.pivot_table(stl_student_aged, values="TOT_POP", index="YEAR", aggfunc=np.sum)

In [76]:
stl_students_by_year.head()

      TOT_POP
YEAR
2000    76465
2001    73708
2002    71357
2003    69678
2004    67502

In [81]:
county_data_2019 = pd.read_csv("county_data_10_19.csv")

In [85]:
county_data_2019.head()

,SUMLEV,STATE,COUNTY,STNAME,CTYNAME,YEAR,AGEGRP,TOT_POP,TOT_MALE,TOT_FEMALE,...,HWAC_MALE,HWAC_FEMALE,HBAC_MALE,HBAC_FEMALE,HIAC_MALE,HIAC_FEMALE,HAAC_MALE,HAAC_FEMALE,HNAC_MALE,HNAC_FEMALE
0,50,29,1,Missouri,Adair County,1,0,25607,12204,13403,...,242,255,9,17,15,13,4,3,2,5
1,50,29,1,Missouri,Adair County,1,1,1438,759,679,...,30,18,3,3,2,0,1,2,1,3
2,50,29,1,Missouri,Adair County,1,2,1338,716,622,...,13,17,1,4,1,1,0,0,0,0
3,50,29,1,Missouri,Adair County,1,3,1317,670,647,...,9,18,0,1,1,1,0,0,0,0
4,50,29,1,Missouri,Adair County,1,4,2999,1379,1620,...,40,50,1,5,6,4,1,0,0,1

In [87]:
stl_data_2019 = county_data_2019[county_data_2019['CTYNAME'] == "St. Louis city"]

In [88]:
stl_data_2019.shape

(228, 80)

In [89]:
stl_data_2019_filtered = stl_data_2019[["YEAR", "AGEGRP", "TOT_POP"]]

In [90]:
stl_data_2019_filtered.shape

(228, 3)

In [91]:
stl_data_2019_filtered = stl_data_2019_filtered[stl_data_2019_filtered["YEAR"] > 3]

In [92]:
stl_data_2019_filtered.shape

(171, 3)

In [93]:
stl_data_2019_filtered["YEAR"] = stl_data_2019_filtered["YEAR"] + 2007

In [94]:
stl_data_2019_filtered.head()

       YEAR  AGEGRP  TOT_POP
26049  2011       0   319344
26050  2011       1    21279
26051  2011       2    17376
26052  2011       3    16699
26053  2011       4    20887

In [95]:
stl_student_aged_2019 = stl_data_2019_filtered.loc[(stl_data_2019_filtered["AGEGRP"] >= 2) & (stl_data_2019_filtered["AGEGRP"] <= 4)]

In [96]:
stl_student_aged_2019.head()

       YEAR  AGEGRP  TOT_POP
26051  2011       2    17376
26052  2011       3    16699
26053  2011       4    20887
26070  2012       2    17616
26071  2012       3    16290

In [97]:
stl_students_by_year_2019 = pd.pivot_table(stl_student_aged_2019, values="TOT_POP", index="YEAR", aggfunc=np.sum)

In [98]:
stl_students_by_year_2019.head()

      TOT_POP
YEAR
2011    54962
2012    53536
2013    52241
2014    51164
2015    50012

In [99]:
stl_students_school_aged_by_year = stl_students_by_year.append(stl_students_by_year_2019)

In [100]:
stl_students_school_aged_by_year.shape

(20, 1)

In [ ]:
stl_students_school_aged_by_year.to_csv("school_aged_students")